run/tutorials/incompressible/pimpleFoam/RAS/wingMotion/wingMotion2D_simpleFoam/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    topAndBottom
    {
        type            patch;
        nFaces          72;
        startFace       25179;
    }
    inlet
    {
        type            patch;
        nFaces          40;
        startFace       25251;
    }
    outlet
    {
        type            patch;
        nFaces          62;
        startFace       25291;
    }
    wing
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          378;
        startFace       25353;
    }
    front
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          12565;
        startFace       25731;
    }
    back
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          12565;
        startFace       38296;
    }
)

// ************************************************************************* //
